/*************************************************************************************
 *
 * 文 件 名:   HalconColors
 * 描    述:
 *
 * 版    本：  V1.0.0.0
 * 创 建 者：  Bing
 * 创建时间：  2023/5/11 10:01:23
 * ======================================
 * 历史更新记录
 * 版本：V          修改时间：         修改人：
 * 修改内容：
 * ======================================
*************************************************************************************/

namespace BingLibrary.Vision
{
    public enum HalconMouseMode
    {
        Include_ROI,
        Exculude_ROI,
        View_None,
        View_Zoom,
        View_Move,
    }
}