/*************************************************************************************
 *
 * 文 件 名:   HalCoordinateSystem
 * 描    述:
 *
 * 版    本：  V1.0.0.0
 * 创 建 者：  Bing
 * 创建时间：  2022/1/27 13:23:25
 * ======================================
 * 历史更新记录
 * 版本：V          修改时间：         修改人：
 * 修改内容：
 * ======================================
*************************************************************************************/

namespace BingLibrary.Vision
{
    /// <summary>
    /// 坐标系统，窗口，图像
    /// </summary>
    public enum HalconCoordinateSystem
    {
        window, image
    }
}